app/Controllers/Home.php

SELECT COUNT(*) AS `numrows`
FROM `payments`
SELECT COUNT(*) AS `numrows`
FROM `customers`
SELECT COUNT(*) AS `numrows`
FROM `vehicles`
SELECT `payments`.*, `customers`.`name` as `customer_name`, `vehicles`.`model` as `vehicle_model`, `vehicles`.`name` as `vehicle_name`, `vehicles`.`price` as `vehicle_price`
FROM `payments`
LEFT JOIN `customers` ON `payments`.`customer_id` = `customers`.`id`
LEFT JOIN `vehicles` ON `payments`.`vehicle_id` = `vehicles`.`id`
---
    public function index(): string
    {
        // Get total records for each table
        $totalPayments = $this->paymentsTable->countAllResults();
        $totalCustomers = $this->customersTable->countAllResults();
        $totalVehicles = $this->vehiclesTable->countAllResults();

        // Get payment details (optional)
        $this->paymentsTable
            ->select('payments.*, customers.name as customer_name, vehicles.model as vehicle_model, vehicles.name as vehicle_name, vehicles.price as vehicle_price')
            ->join('customers', 'payments.customer_id = customers.id', 'left')
            ->join('vehicles', 'payments.vehicle_id = vehicles.id ', 'left');

        $data = $this->paymentsTable->get()->getResult();