app/Controllers/Payments.php

SELECT `payments`.*, `customers`.`name` as `customer_name`, `vehicles`.`model` as `vehicle_model`, `vehicles`.`name` as `vehicle_name`, `vehicles`.`price` as `vehicle_price`
FROM `payments`
LEFT JOIN `customers` ON `payments`.`customer_id` = `customers`.`id`
LEFT JOIN `vehicles` ON `payments`.`vehicle_id` = `vehicles`.`id`
---
    public function getData(){
        // $data=$this->datatable->get()->getResult();
           // Join the payments table with customers and vehicles tables
           $this->paymentsTable
           ->select('payments.*, customers.name as customer_name, vehicles.model as vehicle_model,vehicles.name as vehicle_name,vehicles.price as vehicle_price')
              ->join('customers', 'payments.customer_id = customers.id', 'left')
              ->join('vehicles', 'payments.vehicle_id = vehicles.id ', 'left');
       $data = $this->paymentsTable->get()->getResult();